[
    {
        "id": 1,
        "src": "static/images/Наполеон.jpg",
        "title": "Торт «Наполеон»",
        "ingredients": "Для теста:<br> - 500 г пшеничной муки;<br> - пачка маргарина;<br> - 2 яйца; <br> - одна чайная ложка соли (5 г);<br> - 7 мл уксуса;<br> - одна чайная ложка растительного масла;<br> - полчашки воды.",
        "steps": [
            {   
                "step": 1,
                "text": "Замес теста. Разбейте яйца в миску, туда же добавьте соль, уксус, муку, масло и тщательно смешайте ингредиенты."
            },
            {
                "step": 2,
                "text": "В полученную смесь тонкой струей добавьте воду. При помощи миксера смешивайте основу, пока не образуется мягкий и эластичный ком теста. Заверните его в пленку и положите в холодильник на полчаса."
            },
            {
                "step": 3,
                "text": "Разделите его на 10 равных частей. Каждую часть раскатайте в тонкий лист. Полученный лист положите на противень, заранее смазанный растительным маслом, и выпекайте при температуре 180 °С 12 минут. Повторите эту процедуру со всеми коржами."
            },
            {
                "step": 4,
                "text": "Яичный белок пока отложите в сторону, а желток взбейте с сахаром до получения густой массы."
            },
            {
                "step": 5,
                "text": "Положите крахмал в небольшую посуду, добавьте немного молока, согласно рецепту, и аккуратно замесите. Добавьте смесь к желткам и снова перемешиваем."
            },
            {
                "step": 6,
                "text": "Налейте оставшееся молоко в кастрюлю и доведите до кипения. Постоянно помешивая, доведите массу до  загустения."
            },
            {
                "step": 7,
                "text": "Охладите крем и взбейте сливочное масло до густой консистенции. Добавьте приготовленную кремовую массу, перемешайте."
            },
            {
                "step": 9,
                "text": "На большое блюдо выложите корж, на него нанесите толстый слой начинки и слегка прижмите. Повторите со всеми выпеченными коржами."
            }
        ]
    },
    {
        "id": 2,
        "src": "static/images/медовик.webp",
        "title": "Медовик",
        "ingredients": "- 500 г муки;<br> - 4 яйца;<br> - 250 г сахара;<br> - 25 г меда;<br> - 200 г сметаны;<br> - 150 мл сгущенного молока;<br> - 80г сливочного масла;<br> - 5 г разрыхлителя;<br> - сода на кончике ножа;<br> - уксус для гашения;<br> - ванильный экстракт.",
        "steps":[
            {   
                "step": "1",
                "text": "Коржи. Взбейте желток и белок до белой массы. Добавьте мед, сметану и тщательно перемешайте. Просейте муку через сито в яичную массу и смешайте до однородности. Добавьте разрыхлитель и перемешайте."
            },
            {
                "step": "2",
                "text": "Достаньте противень для выпечки и разделите получившееся тесто на 6 равных долей. Выпекайте при 180 °С в течение 12 минут."
            },
            {
                "step": "3",
                "text": "Для начинки взбейте масло со сгущенкой и ванилью до густой консистенции."
            },
            {
                "step": "4",
                "text": "Возьмите готовый корж и выложите на него мусс. Повторите те же действия с остальными коржами. Отложите немного топпинга для оформления."
            },
            {
                "step": "5",
                "text": "Оставшуюся массу выложите на торт с помощью кулинарного мешка. Украсьте любыми ягодами и фруктами."
            }
        ]
    },
    {
        "id": 3,
        "src": "static/images/Бисквитный.webp",
        "title": "Бисквитный торт",
        "ingredients": "- 6 яиц;<br> - 250 г сахара;<br> - 400 г муки;<br> -  10 г разрыхлителя;<br> - щепотка соли;<br> - лимонный сок на глаз;<br> - малина, клубника, черника или другие ягоды по вашему выбору;<br> - кондитерские крошки для украшения.",
        "steps":[
            {   
                "step": "1",
                "text": "Выпекание бисквита. Разогрейте духовку до 180 °С."
            },
            {
                "step": "2",
                "text": "Взбейте белки с солью, используя миксер на средней скорости."
            },
            {
                "step": "3",
                "text": "Туда же добавьте сахар и продолжайте смешивание до тех пор, пока консистенция не станет блестящей и плотной."
            },
            {
                "step": "4",
                "text": "Желтки с лимонным соком взбейте до образования светлого оттенка."
            },
            {
                "step": "5",
                "text": "Просейте муку и добавьте разрыхлитель в чашу и аккуратно перемешайте."
            },
            {
                "step": "6",
                "text": "Теперь перелейте на противень, выстеленный бумагой, и выпекайте в течение 25 минут."
            },
            {
                "step": "7",
                "text": "Дайте бисквиту остыть, затем разрежьте его вдоль."
            },
            {
                "step": "8",
                "text": "На нижнюю часть выложите свежие ягоды, сверху крем. Если бисквит получится высокий, то сделайте его в несколько слоев."
            }
        ]
    }
]